Revit 2027 API
PhaseArray.Item Property
Gets or sets a phase at a specified index within the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual Phase this[
	int index
] { get; set; }
Public Overridable Property Item (
	index As Integer
) As Phase
	Get
	Set
public:
virtual property Phase^ Item[int index] {
	Phase^ get (int index);
	void set (int index, Phase^ value);
}
abstract Item : Phase with get, set
override Item : Phase with get, set
Parameters
index Int32
The index of the phase to be set or retrieved.
Return Value
Phase
Returns the phase at the specified index.
See Also
Reference
PhaseArray Class
Autodesk.Revit.DB Namespace